src/app/Http/Controllers/BookController.php

select * from `publishers`
select * from `authors`
---
    protected function addBook()
    {
        $publishers = PublisherModel::all();
        $authors = AuthorModel::all();

select * from `publishers`
select * from `authors`
---
    protected function filterForm()
    {
        $publishers = PublisherModel::all();
        $authors = AuthorModel::all();

select * from `authors` where `authors`.`id` in (4, 8, 29, 35, 37, 46, 60, 67, 73, 87)
select * from `books` where `publisher_id` = '19, 20, 33' limit 20 offset 0
select * from `publishers` where `publishers`.`id` in (19)
select count(*) as aggregate from `books` where `publisher_id` = '19, 20, 33'
---
    protected function filter(BookFilterRequest $request)
    {
        $books = BookModel::with('author', 'publisher');
        $books = (new BooksFilter($books, $request))->apply();
        $books = $books->paginate(20);

delete from `books` where `id` = '1'
---
    protected function delete($id)
    {
        DB::table('books')->whereId($id)->delete();

select * from `books` where `id` = '3'
---
    protected function bookWhereId($id)
    {
        return BookModel::whereId($id)->get();