src/app/Http/Controllers/StudentController.php

insert into `students` (`first_name`, `second_name`, `last_name`) values ('arsdg', 'sdghsfhg', 'safdhgdsh')
---
    protected function createStudent(StudentRequest $request)
    {
        (new Student($request->validated()))->save();

select * from `students`
---
    protected function index()
    {
        $students = Student::all();