src/app/Services/BooksFilter.php

    public function owner($value)
    {
        $publishers = DB::table('publishers')->where('owner_id', $value)->get();
---
select * from `publishers` where `owner_id` = '12'